Show / Hide Table of Contents
Class ReinfBarByTwoPoints
Representing reinforcement bar input by two points in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfBarByTwoPoints
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Reinforcement))]
public class ReinfBarByTwoPoints : ReinforcementGroup
Constructors
Improve this Doc   View Source
ReinfBarByTwoPoints()
Constructor
Declaration
public ReinfBarByTwoPoints()
Properties
Improve this Doc   View Source
BarDistance
Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
Declaration
public Vector3D BarDistance { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
Distance
Distance between reinforcement layers
Declaration
public double Distance { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MasterComponent1
First master component of reinforcement
Declaration
public ReferenceElement MasterComponent1 { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterComponent2
Second master component of reinforcement
Declaration
public ReferenceElement MasterComponent2 { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterPoint1
First master point of reinforcement
Declaration
public int MasterPoint1 { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
MasterPoint2
Second master point of reinforcement
Declaration
public int MasterPoint2 { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
NumOfLayers
Number of layers
Declaration
public int NumOfLayers { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Position1
Offset between first master point and first point of bar
Declaration
public Vector3D Position1 { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
Position2
Offset between second master point and second point of bar
Declaration
public Vector3D Position2 { get; set; }
Property Value
 Type |  Description
 Vector3D
 Improve this Doc
 View Source